package main

func main() {

}

/*
Урок 7. Интерфейсы. Ошибки. Основы обработки ошибок
1. С какими интерфейсами мы уже сталкивались в предыдущих уроках?
Ответ: Сталкивались с Print и Scan в которых используются интерфейсы Writer и Reader.

2. Посмотрите примеры кода в своём портфолио. Везде ли ошибки обрабатываются грамотно?
Хотите ли вы переписать какие-либо функции?
Ответ: Нет, ошибки не обрабатываются грамотно, но в данных вариантах я бы не стал менять, так как вывода строки с нужным текстом хватает и понятнее.
*/
